# SolidOrShellTessellationControls Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidOrShellTessellationControls Class
Members See Also
---
Controls various aspects of the triangulation produced by [!:SolidUtils::tessellateSolidOrShell()] method.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class SolidOrShellTessellationControls : IDisposable
```

Visual Basic
---
```text
Public Class SolidOrShellTessellationControls _
	Implements IDisposable
```

Visual C++
---
```text
public ref class SolidOrShellTessellationControls : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SolidOrShellTessellationControls
# See Also
SolidOrShellTessellationControls Members
Autodesk.Revit.DB Namespace